//#define  _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
//int main()
//{
//	//创建的同时给数组一些值，这叫初始化
//	int arr[10] = {1,2,3,4,5,6,7,8,9,10};//完全初始化
//	int arr2[10] = { 1,2,3 };//不完全初始化，剩余的元素默认初始化为0，字符串类型为\0
//	int arr3[] = { 1,2,3,4,5,6,7,8,9,10 };//这里没有指定数组元素个数，编译会根据初始化的内容来确定数组的元素个数
//
//	int arr4[] = { 1,2,3 };//3个元素
//	int arr5[10] = { 1,2,3 };//10个元素
//
//	char arr6[3] = { 'a', 'b', 'c' };
//	char arr7[] = { 'a', 'b', 'c' };
//	//以上两个数组一样
//
//	char arr10[10] = "abc";
//	char arr11[] = "abc";
//
//	char arr8[] = "abc";
//	char arr9[] = { 'a', 'b', 'c' };
//
//	printf("%s\n", arr8);
//	printf("%s\n", arr9);//打印字符串打印到'\0'
//
//	return 0;
//}
