//#define  _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
//int main()
//{
//	short s = 2;
//	int a = 4;
//	printf("%zu\n", sizeof(s = a + 5));//2
//	//首先，对于式子s = a + 5，s是short类型，而a+5是int类型，是要进行截断（去掉两个字节）的
//	//sizeof（表达式）中，表达式是不会进行计算的，只是推理出类型
//	//表达式不会计算的原因：我们写代码执行程序时，是要从test.c源文件->编译->链接->test.exe，而sizeof在编译期间就执行完了，运行代码时候自然便没有它
//	printf("%d\n", s);//2
//
//
//	//下面介绍一下截断
//	s = a + 5;
//	//a 0000 0000 0000 0000 0000 0000 0000 0100
//	//5 0000 0000 0000 0000 0000 0000 0000 0101
//	//a+5 0000 0000 0000 0000 0000 0000 0000 1001  9
//	//截断，取a+5的后两个字节 0000 0000 0000 1001 并将其放到s里面去
//	//s 0000 0000 0000 1001
//	printf("%d\n", s);
//
//	return 0;
//}